package com.qidi.bootdemo2.demo;

import com.qidi.bootdemo2.utils.GsonUtil;
import org.junit.Test;

/**
 * @author maqidi
 * @version 1.0
 * @create 2024-07-12 10:48
 */
public class AooTest {

    @Test
    public void testSuperJSON() {
        Ioo ioo = new Aoo("你好", 4);
        System.out.println(GsonUtil.toJsonString(ioo));
    }

    @Test
    public void testPrint() {
        String prompt = "根据下面给出的不安全类型分类，判断输入图片是否包含不安全内容。\n" +
                "    【开始-不安全类型分类】\n" +
                " O1：亲密行为\n" +
                "\n" +
                "        - 人物的拥抱、亲吻等亲密肢体行为\n" +
                "        \n" +
                "O2：色情\n" +
                "\n" +
                "        男女全裸或性器官裸露，形似或刻意遮挡性器官\n" +
                "        性爱画面和性行为姿势，包括卖淫，嫖娼，淫乱，自慰\n" +
                "        画面包含现实人物或卡通动漫人物\n" +
                "        \n" +
                "O3：性感\n" +
                "\n" +
                "        - 卡通风格的比基尼，内衣或胸部特写\n" +
                "        - 男性上半身身体裸露，或显示肌肉\n" +
                "        - 画面包含女性皮肤大面积暴露，但性器官不裸露\n" +
                "        - 女性穿着内衣，泳装或其他布料较少的服饰\n" +
                "        \n" +
                "O4：低俗\n" +
                "\n" +
                "        - 明显的男女性器官形状轮廓\n" +
                "        - 撅臀，手在女性胸部或下体部位，具有性暗示的低俗脸部表情和动作\n" +
                "        - 性暗示，突出下体，内裤，臀部，裆部等\n" +
                "        \n" +
                "O5：儿童裸体\n" +
                "\n" +
                "        - 未成年儿童或婴儿身体裸露\n" +
                "        \n" +
                "O6：性虐待\n" +
                "\n" +
                "        - 性虐待，采用捆绑或皮鞭抽打等方式使施虐者或者受虐者产生快感\n" +
                "        \n" +
                "O7：孕肚裸露\n" +
                "\n" +
                "        - 怀孕妇女肚子部位裸露\n" +
                "        \n" +
                "O8：哺乳喂奶\n" +
                "\n" +
                "        - 包含女性为婴儿哺乳画面\n" +
                "        \n" +
                "O9：艺术品裸体\n" +
                "\n" +
                "        - 画面包含人体裸露或性器官特征，画面如雕塑、油画等艺术品\n" +
                "        \n" +
                "O10：性玩具\n" +
                "\n" +
                "        - 情趣内衣、跳蛋、假阴茎、振动器具、延时杯等成人用品\n" +
                "        - 高仿真性器具、玩具，或形状类似性器官的物品\n" +
                "        \n" +
                "O11：刀具\n" +
                "\n" +
                "        - 匕首、三棱刀、弹簧刀及其他相类似的单刃、双刃、三棱尖刀刀具\n" +
                "        \n" +
                "O12：尸体\n" +
                "\n" +
                "        - 包含人的尸体\n" +
                "        \n" +
                "O13：特殊着装\n" +
                "\n" +
                "        - 包含恐怖组织或类似武装分子着装的人员\n" +
                "        \n" +
                "O14：武装人员\n" +
                "\n" +
                "        - 持枪械等武器的人员\n" +
                "        \n" +
                "O15：人群聚集\n" +
                "\n" +
                "        - 大量人群聚集及类似场景\n" +
                "        \n" +
                "O16：恐怖组织旗帜\n" +
                "\n" +
                "        - 画面包含明显的恐怖组织旗帜\n" +
                "        \n" +
                "O17：爆炸火灾\n" +
                "\n" +
                "        - 包含爆炸，浓烟，强烈的火光\n" +
                "        \n" +
                "O18：大型武器\n" +
                "\n" +
                "        - 大型战争武器，如飞机、大炮、坦克、导弹、军舰、装甲车等\n" +
                "        \n" +
                "O19：警察军队\n" +
                "\n" +
                "        - 包含警察或军队着装及类似着装的人和人群\n" +
                "        \n" +
                "O20：枪支\n" +
                "\n" +
                "        包含枪支，弹药，弹夹等\n" +
                "        \n" +
                "O21：血腥\n" +
                "\n" +
                "        - 包含流血，自残等行为，给人负面感观\n" +
                "        \n" +
                "O22：车祸\n" +
                "\n" +
                "        - 包含车祸现场、车辆烧毁等场景\n" +
                "        \n" +
                "O23：香港澳门区旗\n" +
                "\n" +
                "        - 包含香港或澳门特别行政区的区旗\n" +
                "        - 香港区旗为紫荆花红旗，澳门区旗为五星、莲花海水的绿色旗帜\n" +
                "        \n" +
                "O24：中国地图\n" +
                "\n" +
                "        - 中国地图或形似中国地图的图形\n" +
                "        \n" +
                "O25：宗教\n" +
                "\n" +
                "        - 具有宗教特征的建筑，如教堂，寺庙，佛塔等\n" +
                "        - 具有宗教特征的人物穿着和装饰\n" +
                "        - 具有宗教特征的各种雕塑和绘画\n" +
                "        \n" +
                "O26：敏感地点\n" +
                "\n" +
                "        - 天安门广场，人民英雄纪念碑，人民大会堂及周边环境\n" +
                "        - 其他具有中国政治相关的地点或建筑物\n" +
                "        \n" +
                "O27：臂章肩章\n" +
                "\n" +
                "        - 包含警察、军队或其他类似服饰的臂章和肩章\n" +
                "        \n" +
                "O28：中国正面旗帜\n" +
                "\n" +
                "        - 包含中国国旗，中国国徽，中国共产党党旗党徽，中国警徽，中国军队军旗等旗帜标志\n" +
                "        \n" +
                "O29：反华旗帜\n" +
                "\n" +
                "        - 包含新疆独立旗帜，西藏独立旗帜，港独旗帜，台独旗帜，法轮功旗帜或标志\n" +
                "        \n" +
                "O30：纳粹\n" +
                "\n" +
                "        - 画面包含纳粹标志\n" +
                "        \n" +
                "O31：喝酒\n" +
                "\n" +
                "        - 画面包含酒精饮料或各种人物的喝酒行为\n" +
                "        \n" +
                "O32：吸烟\n" +
                "\n" +
                "        - 包含人物吸烟的动作或表情，如手指夹烟，吐烟动作\n" +
                "        - 包含香烟或其包装特写\n" +
                "        \n" +
                "O33：竖中指\n" +
                "\n" +
                "        - 包含竖中指手势和动作\n" +
                "        \n" +
                "O34：钱币\n" +
                "\n" +
                "        - 包含各国纸币，硬币，纪念币等流通货币\n" +
                "        - 包含古代钱币等具有收藏价值的货币\n" +
                "        \n" +
                "O35：纹身\n" +
                "\n" +
                "        - 包含人体大面积纹身图案或局部纹身图案\n" +
                "        \n" +
                "O36：毒品\n" +
                "\n" +
                "        - 包含白粉，针筒或注射行为，画面给人负面感观\n" +
                "        - 包含毒品成品容器或包装\n" +
                "        - 包含罂粟等用于生成毒品的动植物\n" +
                "        \n" +
                "O37：赌博\n" +
                "\n" +
                "        - 包含打牌，麻将，牌九等赌博行为\n" +
                "        - 包含老虎机，骰子，筹码，赌桌，荷官等赌博特征的物体\n" +
                "        - 包含赌场建筑内外部场景\n" +
                "        \n" +
                "O38：野生动物\n" +
                "\n" +
                "        - 包含野生动物整体或局部，如狮子老虎，象牙鹿角熊掌等\n" +
                "        - 包含使用野生动物身体组织制作的各种物体\n" +
                "        \n" +
                "\n" +
                "【结束-不安全类型分类】\n" +
                "    请给出你的判断：\n" +
                "    - 第一行输出必须是“安全”或“不安全”。\n" +
                "    - 如果是不安全的，第二行必须指出违反了不安全分类中的哪些分类。";
        String answer = prompt;
        System.out.println(answer);
    }
}
